{
  "docTitle": "Jesser Susi - Online CV",
  "about": [
    {
      "info": "Most recently, I was part of an Agile cross-functional team at Infor tasked with migrating the codebase for an existing enterprise application from Windows Form to ASP.Net MVC. We leveraged Web Services and XML while working with our Australian counterparts to deliver the desired solution. We used JavaScript and jQuery for front-end and, aside from development, I was assigned to build and deploy our server for my QA team for their testing processes. Also, I mentored one of my new team members. I have experence working with small teams to develop trading platforms using C#, WPF and SQL for foreign exchange companies."
    },
    {
      "info": "I like to solve problems on my own and find satisfaction when the solutions I developed are working. However, I also believe that working collaboratively with a team is crucial to delivery of the product. So, if there is a particularly difficult problem, I collaborate with my colleagues and use it as a learning experience to improve my skills."
    },
    {
      "info": "I enjoy learning new technologies and currently I’m doing some React.js and Xamarin development which is live on Heroku. I love to bake, cook, take photographs, cycle, travel and play games with friends."
    },
    {
      "info": "Looking forward to connecting with ICT professionals."
    }
  ],
  "experience": [
    {
      "name": "Infor",
      "location": "Manila, Philippines",
      "start": "Nov 2014",
      "end": "Apr 2018",
      "title": "Software Engineer",
      "projectInfo": "Infor Pathway (provides capabilities specifically for Australia and New Zealand local councils to improve the efficiency of business processes including people management, local and property management, revenue and regulatory management)",
      "responsibilities": [
        "Migrated codebase of an existing enterprise application from Windows forms to ASP.NET MVC, leveraging Web Services and XML while working with counterparts from Australia",
        "Conducted unit testing and regression testing for functionality and quality control",
        "Reviewed deliverables with system stakeholders",
        "Developed and presented web form prototypes for the organisation",
        "Built and deployed server for QA testing",
        "Collated and reported feedback on UI bugs to Infor design team based in USA",
        "Created and presented weekly data presentations to team",
        "Assigned as point person for server deployment and implemented a systematic approach",
        "Coached new team member to familiarise herself about the development processes of the team",
        "Acted as Scrum Master on the first phase of the development",
        "Assigned as point person for overseeing the front-end development of the team and reporting of bugs to Infor's design team based in USA"
      ],
      "tools": [
        "MS Visual Studio",
        "C# .Net",
        "ASP.NET",
        "MVC",
        "Razor",
        "JavaScript and jQuery",
        "Bootstrap",
        "JIRA",
        "MS Team Foundation Server (TFS) for version control and project management",
        "Microsoft SQL Server",
        "Agile Scrum"
      ]
    },
    {
      "name": "Londa Online Technologies, Inc.",
      "location": "Manila, Philippines",
      "start": "Feb 2013",
      "end": "Nov 2014",
      "title": "Programmer",
      "projectInfo": "Foreign Exchange Trading Platform",
      "responsibilities": [
        "Developed form-based software trading application that sends transactions requests to server asynchronously",
        "Designed and developed UI using WPF and DevExpress",
        "Researched and analysed formula to be used in foreign exchange trading computation",
        "Coordinated development issues to Russian counterpart",
        "Performed manual testing for functionality and quality control",
        "Debugged, analysed and fixed issues found on the software application",
        "Research and documentation"
      ],
      "tools": [
        "MS Visual Studio",
        "C# .Net",
        "WPF",
        "DevExpress",
        "TortoiseSVN",
        "JIRA"
      ]
    },
    {
      "name": "Private Scandinavian Sparkasse",
      "location": "Manila, Philippines",
      "start": "Nov 2011",
      "end": "Oct 2012",
      "title": "Junior Software Developer",
      "projectInfo": "Foreign Exchange Trading Platforms (client and server applications)",
      "responsibilities": [
        "Analyzed processes of client and server applications of foreign exchange trading platforms",
        "Initially developed prototypes of client and servers applications using Visual C++ and MS SQL",
        "Developed trading platforms using C# and MS SQL",
        "Used WCF for communications between client and server applications",
        "Research and documentation"
      ],
      "tools": [
        "MS Visual Studio",
        "C# .Net",
        "MS SQL Server",
        "WCF",
        "TortoiseSVN"
      ]
    }
  ],
  "projects": [
    {
      "name": "GloomBlue",
      "description": "A simple weather app created using React.js that displays the weather information based on the inputted city name. It consumes data from OpenWeatherMap and uses https://datahub.io/core/country-list to convert country code based on 2 digit codes (ISO 3166-1) into their full name. Map can also be displayed (provided by react-leaflet) base on the geo coordinates of the city.",
      "link": "gloomblue"
    },
    {
      "name": "Artist's Popular Tracks | Spotify",
      "description": "A simple app created using React.js that lists the popular songs from a particular artist. The app displays the album cover and some info upon clicking on the song(card). This utilizes Spotify's APIs to search for artist ID, albums, and songs.",
      "link": "top10tracks"
    }
  ],
  "skills": [
    { "info": "C# .Net, ASP.NET MVC, WPF" },
    { "info": "javaScript, jQuery, HTML, CSS, Bootstrap, React.js" },
    { "info": "Microsoft SQL Server" }
  ],
  "tools": [
    { "info": "Web Services, REST APIs" },
    { "info": "Visual Studio, Visual Studio Code, TFS, JIRA, GitHub" },
    { "info": "Agile Scrum Development" }
  ]
}
