{
  "about": [
    {
      "info": "Experienced Software Engineer with demonstrated working history in different organisations (government agency, software solution and foreign exchange companies)."
    },
    {
      "info": "Skilled in C#, ASP.Net, MS SQL, Azure, WPF, Power Apps, React.js, JavaScript, jQuery and Bootstrap."
    },
    {
      "info": "Previous experiences include working at Trade Me as Full Stack Developer (Fixed Term), and Software Engineer at the Ministry of Business, Innovation and Employment."
    },
    {
      "info": "Also worked in an Agile cross-functional team at Datacom (Fixed Term) to deliver a software application for local councils in New Zealand and Australia. The work I did in Infor is to migrate the codebase of an existing enterprise application from Windows Form to ASP.Net MVC. We leveraged Web Services and XML while working with our Australian counterparts to deliver the desired solution. We used JavaScript and jQuery for front-end and, aside from development, I was assigned to build and deploy our server for my QA team for their testing processes. Also, I mentored one of my new team members. I have experience working with small teams to develop trading platforms using C#, WPF and SQL for foreign exchange companies."
    },
    {
      "info": "I like to solve problems on my own and find satisfaction when the solutions I developed are working. However, I also believe that working collaboratively with a team is crucial to delivery of the product. So, if there is a particularly difficult problem, I collaborate with my colleagues and use it as a learning experience to improve my skills."
    },
    {
      "info": "I enjoy learning new technologies and gets satisfaction with the new applications I create. I love to bake, cook, take photographs, cycle, travel and play games with friends."
    },
    {
      "info": "Looking forward to connecting with ICT professionals."
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Science in Information Technology",
      "institution": "Polytechnic University of the Philippines",
      "start": "Jun 2008",
      "end": "April 2012",
      "assessment": "Level 7, NZQA Assessed"
    }
  ],
  "experience": [
    {
      "name": "Trade Me",
      "website": "https://www.trademe.co.nz/",
      "location": "Wellington, New Zealand",
      "start": "Aug 2024",
      "end": "Feb 2025",
      "title": "Full Stack Developer (Fixed Term)",
      "projectInfo": "e-commerce, online auction and classifieds website.",
      "responsibilities": [
        "Added a new feature and worked on some updates to the website using Angular, TypeScript and CSS",
        "Updated the API to support additional property when user unsubscribes",
        "Updated the existing APIs used within Trade Me",
        "Upgraded and updated the environments using Terraform",
        "Wrote SQL script for listing maintenance",
        "Facilitated Scrum ceremonies"
      ],
      "tools": [
        "JetBrains Rider, WebStorm, and Datagrip",
        "C# .Net",
        "Angular, TypeScript, JavaScript and jQuery",
        "Playwright Tests",
        "Google Cloud",
        "Terraform",
        "Git"
      ]
    },
    {
      "name": "Ministry of Business, Innovation and Employment",
      "website": "https://www.mbie.govt.nz/",
      "location": "Wellington, New Zealand",
      "start": "Jan 2022",
      "end": "Mar 2024",
      "title": "Software Engineer",
      "projectInfo": "Standards New Zealand, Te Reo Māori Outlook Add-in, Covid Compliance Tool, et al.",
      "responsibilities": [
        "Developed an Outlook Add-in which inserts Te Reo Māori greetings into the message body. The Add-in has been presented and implemented to other government agencies (Department of Internal Affairs, WorkSafe, Housing and Urban Development, Ministry of Primary Industries, Māori Language Commission, StatsNZ and Auckland Transport).",
        "Developed an Azure function app which processes a .csv file for copying a collection of files from one storage account to another, then generates a SAS key which will be sent through an email of the admin",
        "Implemented custom watermarking solution using open-source packages instead of using paid application",
        "Deploy codebase to different environments",
        "Develop and support applications using Power Platform (Power Apps and Dynamics 365)",
        "Implement chat bot using Terraform, QnA Maker and LUIS to be used within the organization",
        "Work on tech debt—upgrading the .Net framework and updating the codebase when needed",
        "Built and deployed server for QA testing",
        "Develop new features and maintain software applications for the organization",
        "Write SQL scripts to create or update the table when needed for application support and maintenance"
      ],
      "tools": [
        "Microsoft Visual Studio",
        "C# .Net",
        "ASP.NET",
        "MVC",
        "Razor",
        "JavaScript and jQuery",
        "Bootstrap",
        "Azure",
        "Azure DevOps",
        "Terraform",
        "Microsoft SQL Server",
        "Power Apps",
        "Git"
      ]
    },
    {
      "name": "Datacom",
      "website": "https://datacom.com/",
      "location": "Wellington, New Zealand",
      "start": "Nov 2020",
      "end": "Dec 2021",
      "title": "Software Developer (Fixed Term)",
      "projectInfo": "Datascape is a cloud-based solution helping councils to engage and work more collaboratively with their communities. It uses the latest technology to provide a single source of truth across all council services.",
      "responsibilities": [
        "Collaboratively worked in an agile manner with business analysts to turn requirements into technical design, which will be used by the local councils in New Zealand and Australia",
        "Investigated and resolve bug tickets, and work on the customer issues that need to be addressed",
        "Performed manual testing on the tickets to help clear out the backlog",
        "Worked on configuration tickets when required for the application",
        "Helped write migration scripts for my non-developer colleagues",
        "Presented the new features to the team members and customers",
        "Worked with the team to deliver fully functional features",
        "Proactively resolved merge conflicts on the Dev and Test branches"
      ],
      "tools": [
        "Microsoft Visual Studio",
        "C# .Net",
        "ASP.NET",
        "MVC",
        "Bootstrap",
        "Confluence",
        "Azure DevOps",
        "Microsoft SQL Server",
        "Git",
        "Agile Scrum"
      ]
    },
    {
      "name": "Infor",
      "website": "https://www.infor.com/",
      "location": "Manila, Philippines",
      "start": "Nov 2014",
      "end": "Apr 2018",
      "title": "Software Engineer",
      "projectInfo": "Infor Pathway (provides capabilities specifically for Australia and New Zealand local councils to improve the efficiency of business processes including people management, local and property management, revenue and regulatory management)",
      "responsibilities": [
        "Migrated codebase of an existing enterprise application from Windows forms to ASP.NET MVC, leveraging Web Services and XML while working with counterparts from Australia",
        "Conducted unit testing and regression testing for functionality and quality control",
        "Reviewed deliverables with system stakeholders",
        "Developed and presented web form prototypes for the organization",
        "Built and deployed server for QA testing",
        "Collated and reported feedback on UI bugs to Infor design team based in USA",
        "Created and presented weekly data presentations to team",
        "Assigned as point person for server deployment and implemented a systematic approach",
        "Mentored new team member to familiarise herself about the team's development processes",
        "Acted as Scrum Master on the first phase of the development",
        "Assigned as point person for overseeing the front-end development of the team and reporting of bugs to Infor's design team based in USA"
      ],
      "tools": [
        "Microsoft Visual Studio",
        "C# .Net",
        "ASP.NET",
        "MVC",
        "Razor",
        "JavaScript and jQuery",
        "Bootstrap",
        "JIRA",
        "Microsoft Team Foundation Server (TFS) for version control and project management",
        "Microsoft SQL Server",
        "Agile Scrum"
      ]
    },
    {
      "name": "Londa Online Technologies, Inc.",
      "website": "https://www.zetaforex.com/",
      "location": "Manila, Philippines",
      "start": "Feb 2013",
      "end": "Nov 2014",
      "title": "Programmer",
      "projectInfo": "Foreign Exchange Trading Platform",
      "responsibilities": [
        "Developed form-based software trading application that sends transactions requests to server asynchronously",
        "Designed and developed UI using WPF and DevExpress",
        "Researched and analysed formula to be used in foreign exchange trading computation",
        "Coordinated development issues to Russian counterpart",
        "Performed manual testing for functionality and quality control",
        "Debugged, analysed and fixed issues found on the software application",
        "Research and documentation"
      ],
      "tools": [
        "Microsoft Visual Studio",
        "C# .Net",
        "WPF",
        "DevExpress",
        "TortoiseSVN",
        "JIRA"
      ]
    },
    {
      "name": "Private Scandinavian Sparkasse",
      "website": "https://pssforex.com/",
      "location": "Manila, Philippines",
      "start": "Nov 2011",
      "end": "Oct 2012",
      "title": "Junior Software Developer",
      "projectInfo": "Foreign Exchange Trading Platforms (client and server applications)",
      "responsibilities": [
        "Analyzed the processes and developed client and server trading platforms",
        "Researched technologies on how client and server applications can communicate",
        "Researched and implemented ways to address application's performance issue",
        "Performed regression testing for functionality and quality control",
        "Debugged, analysed and identified bottlenecks in application performance",
        "Initially developed prototypes of client and server applications using Visual C++ and SQL",
        "Used WCF for communications between client and server applications",
        "Research and documentation",
        "Offered a permanent job after completing the internship program for three months"
      ],
      "tools": [
        "Microsoft Visual Studio",
        "C# .Net",
        "Microsoft SQL Server",
        "WCF",
        "TortoiseSVN"
      ]
    }
  ],
  "projects": [
    {
      "name": "GloomBlue",
      "description": "A simple weather app created using React.js that displays the weather information based on the inputted city name. It consumes data from OpenWeatherMap and uses https://datahub.io/core/country-list to convert country code based on 2 digit codes (ISO 3166-1) into their full name. Map can also be displayed (provided by react-leaflet) base on the geo coordinates of the city.",
      "link": "gloomblue"
    },
    {
      "name": "Artist's Popular Tracks | Spotify",
      "description": "A simple app created using React.js that lists the popular songs from a particular artist. The app displays the album cover and some info upon clicking on the song (card). This utilizes Spotify's APIs to search for artist id, albums, and songs.",
      "link": "top10tracks"
    }
  ],
  "skills": [
    { "info": "C# .Net, ASP.NET MVC, WPF" },
    { "info": "Angular, React.js, TypeScript, javaScript, jQuery, HTML, CSS, Bootstrap" },
    { "info": "Microsoft SQL Server" },
    { "info": "Visual Studio, Visual Studio Code, Rider, WebStorm" },
    { "info": "Power Platform, Power Apps, Microsoft D365" }
  ],
  "tools": [
    { "info": "Web Services and APIs, REST APIs" },
    { "info": "Microsoft TFS, JIRA, Git, GitHub, Heroku, Netlify" },
    { "info": "Agile Scrum Development, Kanban" },
    { "info": "Unit Tests, MSTest, NUnit, Playwright Tests" },
    { "info": "Terraform, Azure, Google Cloud" }
  ],
  "labels": [
    {
      "about": "ABOUT ME",
      "skills": "TECHNICAL SKILLS",
      "experience": "EXPERIENCE & EDUCATION",
      "personalProj": "PERSONAL PROJECTS",
      "project": "Project",
      "responsibilities": "Responsibilities",
      "tools": "Software Development Tools",
      "socGitHub": "GitHub",
      "socLinkedIn": "LinkedIn",
      "socEmail": "Send an email",
      "socCV": "Download CV"
    }
  ]
}